In [1]:
import pandas as pd

In [3]:
list_1 = [10,20,30,40,50]
series_1 = pd.Series(list_1)
series_1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
date_range  = pd.date_range(start='2021-05-01',end='2021-05-31')
date_range

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12',
               '2021-05-13', '2021-05-14', '2021-05-15', '2021-05-16',
               '2021-05-17', '2021-05-18', '2021-05-19', '2021-05-20',
               '2021-05-21', '2021-05-22', '2021-05-23', '2021-05-24',
               '2021-05-25', '2021-05-26', '2021-05-27', '2021-05-28',
               '2021-05-29', '2021-05-30', '2021-05-31'],
              dtype='datetime64[ns]', freq='D')

In [7]:
data = {'Name':["Anu","Pappan","Shijin"],
        "Age":[25,25,22]}
df = pd.DataFrame(data)
df

     Name  Age
0     Anu   25
1  Pappan   25
2  Shijin   22

In [9]:
data = [["Anand",22],["Pappan",25],["Shijin",22]]
df = pd.DataFrame(data,columns=["Name","Age"])
df

     Name  Age
0   Anand   22
1  Pappan   25
2  Shijin   22

In [10]:
df = pd.read_csv("data.csv")
df

   unitprice  unitsold
0        2.3         5
1        3.5        10
2       20.0         5
3       13.0         4

In [28]:
data = {'Name':['Pappan','Anand','Shijin'],'Age':[20,30,35],'Score':[20,99,98]}
df = pd.DataFrame(data)
df

     Name  Age  Score
0  Pappan   20     20
1   Anand   30     99
2  Shijin   35     98

In [26]:
df = df.sort_values(by=['Name'])

In [29]:
df

     Name  Age  Score
0  Pappan   20     20
1   Anand   30     99
2  Shijin   35     98

In [49]:
data = {'Name':['Pappan','Anand','Shijin'],'Age':[20,30,35],'Score':[20,99,98]}
custom_index = ['A','B','C']
df = pd.DataFrame(data,index=custom_index)
df

     Name  Age  Score
A  Pappan   20     20
B   Anand   30     99
C  Shijin   35     98

In [50]:
df.reset_index(drop=True,inplace=True)
print(df)

     Name  Age  Score
0  Pappan   20     20
1   Anand   30     99
2  Shijin   35     98